const BEHOOR = {
    "//O/O//O/O//O/O//O/O//O/O//O/O//O/O//O/O": {
        "name": "بحر المتقارب التام",
        "echo_sound": "فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُنْ *** فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُنْ",
        "notes": "العروض صحيحة، والضرب صحيح"
    },
    "//O///O/O//O/O//O/O//O/O//O/O//O/O//O/O": {
        "name": "بحر المتقارب التام",
        "echo_sound": "فَعُولُ فَعُولُنْ فَعُولُنْ فَعُولُنْ *** فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُولُنْ",
        "notes": "العروض صحيحة، والضرب صحيح"
    },
    "//O/O//O/O//O/O//O//O///O/O//O///OO": {
        "name": "بحر المتقارب المجزوء",
        "echo_sound": "فَعُولُنْ فَعُولُنْ فَعُولُنْ فَعُوْ *** فَعُولُ فَعُولُنْ فَعُولُ فَعُوْلْ",
        "notes": "العروض محذوفة، والضرب مقصور"
    }
};
