const ALPHABETS = [
    "ء",
    "أ",
    "ا",
    "إ",
    "آ",
    "ب",
    "ت",
    "ث",
    "ج",
    "ح",
    "خ",
    "د",
    "ذ",
    "ر",
    "ز",
    "س",
    "ش",
    "ص",
    "ض",
    "ط",
    "ظ",
    "ع",
    "غ",
    "ف",
    "ق",
    "ك",
    "ل",
    "م",
    "ن",
    "ه",
    "ة",
    "و",
    "ؤ",
    "ي",
    "ى",
    "ئ"
];

const FORMATIONS = [
    "َ", // فتحة
    "ِ", // كسرة
    "ُ", // ضمة
    "ً", // تنوين الفتح
    "ٍ", // تنوين الكسر
    "ٌ", // تنوين الضم
    "ْ", // سكون
    "ّ" // شدة
];

const SILENT_FORMATION = "ْ"; // سكون

const VOWEL_FORMATIONS = [
    "َ", // فتحة
    "ِ", // كسرة
    "ُ", // ضمة
];