const ALPHABETS = [
    "ء",
    "أ",
    "ا",
    "إ",
    "آ",
    "ب",
    "ت",
    "ث",
    "ج",
    "ح",
    "خ",
    "د",
    "ذ",
    "ر",
    "ز",
    "س",
    "ش",
    "ص",
    "ض",
    "ط",
    "ظ",
    "ع",
    "غ",
    "ف",
    "ق",
    "ك",
    "ل",
    "م",
    "ن",
    "ه",
    "ة",
    "و",
    "ؤ",
    "ي",
    "ى",
    "ئ"
];

const SILENT_FORMATION = "ْ"; // سكون

const DOUBLE_FORMATION = "ّ" // شدة

const FORMATIONS = [
    "َ", // فتحة
    "ِ", // كسرة
    "ُ", // ضمة
    "ً", // تنوين الفتح
    "ٍ", // تنوين الكسر
    "ٌ", // تنوين الضم
    SILENT_FORMATION,
    DOUBLE_FORMATION
];

const VOWEL_FORMATIONS = [
    "َ", // فتحة
    "ِ", // كسرة
    "ُ" // ضمة
];

const NONE_STARTABLE_CHARS = [
    "ء",
    "ة",
    "ؤ",
    "ى",
    "ئ"
];

replaceKeywords = {
    "لا": "لَاْ",
    "لَا": "لَاْ",

    "يا": "يَاْ",
    "يَا": "يَاْ",

    "ما": "مَاْ",
    "مَا": "مَاْ",

    "ذا": "ذَاْ",
    "ذَا": "ذَاْ",
};